# Crear indice a partir de un JSON
POST /indice-prueba/_doc
{"rating": 4.6, "description": "Amano Yukiteru, un estudiante de 2º año de secundaria, es un chico solitario e introvertido que gasta todo su tiempo escribiendo un diario en su celular desde el punto de vista de un espectador. Su único amigo es un producto de su imaginacion, Deus Ex Machina, el Dios del Tiempo y el Espacio. Un día, este dios le da al diario de Yukiteru la habilidad de ver lo que sucedera en los siguientes 90 días en el futuro y enrola a Yukiteru en un torneo mortal donde debera luchar por su vida contra los poseedores de otros diarios similares.", "img": "/uploads/animes/covers/657.jpg", "genre": ["Acción", "Misterio", "Psicológico", "Shounen", "Sobrenatural", "Suspenso"], "type": "Anime", "web_state": "Finalizado", "votes": 2222, "name": "Mirai Nikki", "id": "657", "slug": "mirai-nikki-2011", "episodes_num": 27, "animeRel": [{"name": "Mirai Nikki Redial", "type": " (Secuela)", "slug": "mirai-nikki-redial"}]}

# Obtener mapping del indice anterior
GET /indice-prueba/_mapping

# Generar template apartir del indice generado
PUT /_index_template/template
{
  "index_patterns" : ["anime_data*"]
}

# Crear indice y cargar los documentos mediante bulk
POST _bulk
{"index": {"_index": "anime_data"}}
{"rating": "4.5", "description": "La historia se centra en Hotaru, una chica que se pierde en un bosque en el que se dice habitan muchos fantasmas. Ante ella se le aparece Gin, un joven muchacho que le embelesa con una primera mirada pero al cual ella no se atreve ni a tocar por miedo a que desaparezca.\n", "img": "/uploads/animes/covers/745.jpg", "genre": ["Drama", "Romance", "Shoujo", "Sobrenatural"], "type": "Película", "web_state": "Finalizado", "votes": 1329, "name": "Hotarubi no Mori e", "id": "745", "slug": "hotarubi-no-mori-e", "episodes_num": 1, "animeRel": []}
{"index": {"_index": "anime_data"}}
{"rating": "3.5", "description": "En un futuro en el que una anomalía del Sol ha destrozado la atmósfera de la Tierra, con la consiguiente devastación en el ecosistema. El deterioro del ADN ha reducido la tasa de natalidad de manera dramática, lo que ha forzado a los gobernantes a crear unos clones llamados IC (Ideal Children), así como un gobierno para ellos. El protagonista de la serie es Sam Coin, un ?pirata de la arena? que comercia en el desiento mientras busca un misterioso objeto gigantesco llamado Ozuma, que en su día causó daño a su hermano. En una de sus correrías rescata a una muchacha llamada Maya que está siendo perseguida por un destructor de la arena propiedad del ejército IC ?Shishiasu?. Sam se la lleva a la nave de los piratas de la arena, Barudonosu, situada en el Puerto de Oaaze. Sin embargo, el destructor de la arena de los IC asedia a la Barudanosu.", "img": "/uploads/animes/covers/749.jpg", "genre": ["Acción", "Ciencia Ficción"], "type": "Anime", "web_state": "Finalizado", "votes": 14, "name": "Ozuma", "id": "749", "slug": "ozuma", "episodes_num": 6, "animeRel": []}
{"index": {"_index": "anime_data"}}
{"rating": "4.7", "description": "Relata la historia original de lo que sucede después del arco de Ragnarok.", "img": "/uploads/animes/covers/751.jpg", "genre": ["Acción", "Artes Marciales", "Comedia", "Escolares", "Shounen"], "type": "OVA", "web_state": "Finalizado", "votes": 330, "name": "Shijou Saikyou no Deshi Kenichi OVA", "id": "751", "slug": "shijou-saikyou-no-deshi-kenichi-ovas", "episodes_num": 11, "animeRel": [{"name": "Shijou Saikyou no Deshi Kenichi", "type": " (Precuela)", "slug": "shijou-saikyou-no-deshi-kenichi"}]}
{"index": {"_index": "anime_data"}}
{"rating": "4.7", "description": "Yuzuki Eba se muda desde Tokio a un pueblo del interior, a la casa de un chico llamado Haruto Kirishima. La chica con la cual compartirá más de lo que pretendía parece demasiado enérgica para la vida en el campo. Ella viene de la ciudad pero sin un motivo claro, y disfruta sacándo de su eje a Haruto, quien está enamorado de una compañera de clase e intentará todo lo posible para que su compañera no tenga una idea equivocada de la relación con su nueva huésped. ¿Logrará lidiar exitosamente con ella?", "img": "/uploads/animes/covers/750.jpg", "genre": ["Drama", "Escolares", "Romance", "Shounen"], "type": "OVA", "web_state": "Finalizado", "votes": 84, "name": "Kimi no Iru Machi: Tasogare Kousaten", "id": "750", "slug": "kimi-no-iru-machi-tasogare-kousaten", "episodes_num": 2, "animeRel": [{"name": "Kimi no Iru Machi", "type": " (Secuela)", "slug": "kimi-no-iru-machi"}]}
{"index": {"_index": "anime_data"}}
{"rating": "4.2", "description": "Athena es secuestrada por el Dios Marte en pleno Santuario, el cual en su ataque lanza una columna de piedra contra un pequeño bebé llamado Kouga. Por suerte, el caballero de Sagitario, Seiya, aparece y salva al niño de una muerte segura. Kouga será el nuevo caballero de Pegaso y se enfrentará junto a sus amigos a los planes de Marte.", "img": "/uploads/animes/covers/752.jpg", "genre": ["Acción", "Aventuras", "Fantasía", "Shounen"], "type": "Anime", "web_state": "Finalizado", "votes": 250, "name": "Saint Seiya Omega", "id": "752", "slug": "saint-seiya-omega", "episodes_num": 97, "animeRel": []}
{"index": {"_index": "anime_data"}}
{"rating": "4.1", "description": "Una noche en el año 2006, cuando eran jovenes, los dos hermanos Mutta (el mayor) y Hibito (el menor) vieron un OVNI que hiba en dirección hacia la luna. Esa misma noche decidieron que ellos se convertirian en astronautas y irian al espacio exterior. En el año 2050, Hibito se ha convertido en astronauta y que ademas está incluido en una misión que irá a la luna. En cambio Mutta siguió una carrera mas tradicional, y terminó trabajando en una compañia de fabricación de automoviles. Sin embargo, Mutta termina arruinando su carrera por ciertos problemas que tiene con su jefe. Ahora bien, no sólo perdió su trabajo si no que fue incluido en la lista negra de la industria laboral. Pueda ser que esta sea su unica oportunidad que tenga Mutta de volver a perseguir su sueño de la infancia y convertirse en astronauta, al igual que su perqueño hermano Hibito.", "img": "/uploads/animes/covers/753.jpg", "genre": ["Ciencia Ficción", "Comedia", "Espacial", "Recuentos de la vida", "Seinen"], "type": "Anime", "web_state": "Finalizado", "votes": 204, "name": "Uchuu Kyoudai", "id": "753", "slug": "uchuu-kyoudai", "episodes_num": 99, "animeRel": []}
{"index": {"_index": "anime_data"}}
{"rating": "4.7", "description": "Un slice of life protagonizado por cuatro chicas: Natsumi, Saki, Yuka y Rinko, durante el verano viviran un milagro que cambiará para siempre sus rutinarias vidas...\n", "img": "/uploads/animes/covers/754.jpg", "genre": ["Escolares", "Recuentos de la vida", "Sobrenatural"], "type": "Anime", "web_state": "Finalizado", "votes": 134, "name": "Natsuiro Kiseki", "id": "754", "slug": "natsuiro-kiseki", "episodes_num": 13, "animeRel": []}
{"index": {"_index": "anime_data"}}
{"rating": "4.7", "description": "Segunda temporada de Kimi to boku, La historia gira en torno a los gemelos Yuta y Yuki Asaba, el afeminado Shun Matsuoka y el líder de la clase Kaname Tsukuhara, todos ellos se conocen desde la infancia, aunque eso no signifique que sean los mejores amigos. Un estudiante recientemente transferido al colegio de los chicos, Chizuru Tachibana, entra al círculo de estos amigos, en una comedia sobre el día a día de un grupo de adolescentes.", "img": "/uploads/animes/covers/755.jpg", "genre": ["Comedia", "Drama", "Escolares", "Recuentos de la vida", "Romance", "Shounen"], "type": "Anime", "web_state": "Finalizado", "votes": 130, "name": "Kimi to Boku. 2", "id": "755", "slug": "kimi-to-boku-ii", "episodes_num": 13, "animeRel": [{"name": "Kimi to Boku.", "type": " (Precuela)", "slug": "kimi-to-boku"}]}
{"index": {"_index": "anime_data"}}
{"rating": "4.2", "description": "Primera parte de la OVA, Shin Kyoto-Hen, readapta de nuevo el arco argumental de Kyoto y los planes de Shishio Makoto para apoderarse el gobierno de la era Meiji. La historia se verá desde otro enfoque, relatando la batalla entre Himura Kenshin y Shishio Makoto desde el punto de vista de la ninja Makimachi Misao.\n", "img": "/uploads/animes/covers/756.jpg", "genre": ["Acción", "Drama", "Historico", "Samurai", "Shounen"], "type": "OVA", "web_state": "Finalizado", "votes": 90, "name": "Rurouni Kenshin: Shin Kyoto Hen", "id": "756", "slug": "rurouni-kenshin-shin-kyoto-hen", "episodes_num": 2, "animeRel": [{"name": "Rurouni Kenshin", "type": " (Historia Completa)", "slug": "rurouni-kenshin"}]}
{"index": {"_index": "anime_data"}}
{"rating": "4.6", "description": "Jin Kanzaki, un extraño chico con una marca de ángel en su mano. Vive una vida pobre pero tranquila a lado de su abuelo, junto con otros indigentes cerca de un río. Un día, su vida pacífica cambia cuando un extraño monstruo denominado \"Player\" aparece, cortando cabezas y matando a cualquiera que se cruce en frente de él.", "img": "/uploads/animes/covers/757.jpg", "genre": ["Acción", "Ciencia Ficción", "Drama", "Romance", "Seinen", "Sobrenatural", "Terror"], "type": "Anime", "web_state": "Finalizado", "votes": 232, "name": "Zetman", "id": "757", "slug": "zetman", "episodes_num": 13, "animeRel": []}
{"index": {"_index": "anime_data"}}
{"rating": "4.6", "description": "Es el otoño del 2046, Haruyuki es un estudiante de secundaria que es acosado por sus compañeros. Un día, un encuentro con Kuroyukihime, la chica más guapa de toda la escuela, le cambia la vida. A través de un programa que la chica le da a Haruyuki, este descubre la existencia del mundo virtual \"Accel World\". Ahora el último mono de la escuela será el \"Burst Linker\", un caballero que habrá de defender a una princesa.", "img": "/uploads/animes/covers/759.jpg", "genre": ["Acción", "Ciencia Ficción", "Escolares", "Juegos", "Romance"], "type": "Anime", "web_state": "Finalizado", "votes": 791, "name": "Accel World", "id": "759", "slug": "accel-world", "episodes_num": 26, "animeRel": [{"name": "Sword Art Online", "type": " (Precuela)", "slug": "sword-art-online"}, {"name": "Accel World: Infinite Burst", "type": " (Secuela)", "slug": "accel-world-infinite-burst"}]}
{"index": {"_index": "anime_data"}}
{"rating": "4.4", "description": "Pequeñas historias cortas protagonizadas por los personajes de NARUTO, principalmente por Rock Lee, con un estilo de humor en versión super deforme.", "img": "/uploads/animes/covers/758.jpg", "genre": ["Acción", "Comedia", "Parodia"], "type": "Anime", "web_state": "Finalizado", "votes": 174, "name": "Rock Lee no Seishun Full-Power Ninden", "id": "758", "slug": "rock-lee-no-seishun", "episodes_num": 51, "animeRel": [{"name": "Naruto Shippuden", "type": " (Historia Principal)", "slug": "naruto-shippuden-hd"}]}
{"index": {"_index": "anime_data"}}
{"rating": "4.7", "description": "Segunda Temporada del Anime de Recorder to Randoseru.", "img": "/uploads/animes/covers/760.jpg", "genre": ["Comedia", "Escolares", "Recuentos de la vida", "Seinen"], "type": "Anime", "web_state": "Finalizado", "votes": 71, "name": "Recorder to Randoseru Re&#9834;", "id": "760", "slug": "recorder-to-randoseru-re", "episodes_num": 15, "animeRel": [{"name": "Recorder to Randoseru Do", "type": " (Precuela)", "slug": "recorder-to-randoseru"}, {"name": "Recorder and Randsell Mi", "type": " (Secuela)", "slug": "recorder-and-randsell-mi"}]}
{"index": {"_index": "anime_data"}}
{"rating": "4.2", "description": "Inuko Shiba parece una chica de secundaria normal y corriente, pero su amiga Chako Ishibashi no deja de preguntarse si Inuko es en realidad un perro. Sin embargo, la muchacha no se lo pregunta por no estropear su amistad, así que procura callarse sus dudas.", "img": "/uploads/animes/covers/761.jpg", "genre": ["Comedia"], "type": "Anime", "web_state": "Finalizado", "votes": 37, "name": "Shiba Inuko-san", "id": "761", "slug": "shiba-inuko-san", "episodes_num": 26, "animeRel": []}
{"index": {"_index": "anime_data"}}
{"rating": "4.2", "description": "Al igual que en todas las culturas, los niños Japoneses crecen escuchando constantemente historias contadas por sus abuelos y abuelas. El niño que nació de un melocotón; la princesa de la luna que es descubierta dentro de un bambú; el viejo que puede hacer florecer un árbol de sakuras muerto, entre otras. Estas historias cortas que enseñan a los niños a ver ambos lados de la vida han pasado valores tradicionales de generación en generación.", "img": "/uploads/animes/covers/762.jpg", "genre": ["Historico", "Infantil", "Sobrenatural"], "type": "Anime", "web_state": "Finalizado", "votes": 60, "name": "Furusato Saisei: Nihon no Mukashi Banashi", "id": "762", "slug": "furusato-saisei", "episodes_num": 249, "animeRel": [{"name": "Furusato Meguri Nippon no Mukashibanashi", "type": " (Secuela)", "slug": "furusato-meguri"}]}
{"index": {"_index": "anime_data"}}
{"rating": "4.2", "description": "Un joven llamado Ryo Utsugi sufre de hace tiempo una pesadilla: sueña que es un demonio que está en el Himalaya, y que mataba gente en la prehistoria. Él pertenece a un equipo de alpinismo, y en sus sueños ve unos asesinatos en serie, chicas jóvenes que les están arrancando el corazón. Ryou sufre un accidente de moto, pero se salva milagrosamente. Tras el accidente deja de sufrir las pesadillas, pero escucha y ve a las chicas que les arrancan el corazón pidiendo ayuda.\n", "img": "/uploads/animes/covers/665.jpg", "genre": ["Acción", "Demonios", "Shounen", "Sobrenatural", "Terror"], "type": "Anime", "web_state": "Finalizado", "votes": 57, "name": "Demon Lord Dante", "id": "665", "slug": "demon-lord-dante", "episodes_num": 13, "animeRel": []}
{"index": {"_index": "anime_data"}}
{"rating": "3.8", "description": "Takeru es un huerfano que es acogido por Rokunushuke, maestro de kendo siendo el favorito de todos. Su amigo del orfanato, Takeshi es todo su opuesto y en su primera lucha, Takeru despierta en su instituto medio destruido al ser mandado a un mundo bastante extraño. Encuentra a sus amigos despues de encontrarse con varios peligros y apartir de aqui tendra que enfrentarse a miles de peligros para lograr salir con vida de ahy.", "img": "/uploads/animes/covers/666.jpg", "genre": ["Artes Marciales", "Aventuras", "Drama", "Fantasía", "Romance", "Sobrenatural"], "type": "Anime", "web_state": "Finalizado", "votes": 21, "name": "Izumo Takeki Tsurugi no Senki", "id": "666", "slug": "izumo-takeki-tsurugi-no-senki", "episodes_num": 12, "animeRel": []}
{"index": {"_index": "anime_data"}}
{"rating": "4.7", "description": "Hiyokoi sigue un poco la \"moda\" de muchas series exitosas en el Manga que consiguen una adaptación al anime, aunque de momento sólo con una OVA que salió el 2010.\nEsta es la historia de Nishiyama Hiyori, una chica de 15 años, que tiene un gran problema... su tímidez. Por circunstancias de la vida, ella sufré un accidente un día antes de la ceremonia de comienzo de clases, por ello estuvo meses fuera de la escuela recuperandose en el hospital, ingresa a la escuela a mediados de diciembre (muy tarde) para continuar sus estudios.\nSe le da un asiento junto al chico que menos uno se espera, ya que este no presta atención a clases y es prácticamente el payaso del curso.\nEn una situación que podríamos llamar \"el inverso de Lovely Complex\", aquí la diferencia de estaturas es la clave, midiendo ella 1.40m y él 1.90m. lo que desencadena graciosas situaciones.\nLa historia se va desarrollando en torno a ellos dos, como se van conociendo y como ella se da más confianza para hablar con sus compañeros de clase.\nPD:El estado le daremos como finalizada,por que no se sabe a ciencia cierta si seguiran continuandola....", "img": "/uploads/animes/covers/667.jpg", "genre": ["Escolares", "Romance", "Shoujo"], "type": "OVA", "web_state": "Finalizado", "votes": 162, "name": "Hiyokoi", "id": "667", "slug": "hiyokoi", "episodes_num": 1, "animeRel": []}
{"index": {"_index": "anime_data"}}
{"rating": "3.7", "description": "La trama se centra en el año 4088 S.C. El planeta de los humanos se ve envuelto en un fenómeno denominado Lost Property, que acaba destruyendo a 4 sistemas planetarios, es por ello que la humanidad se ve obligada a vivir en colonias espaciales. Aunque, todavía tienen un planeta donde poderse alojar, dicho planeta es Zion, sin embargo, los humanos deben defenderlo de unos seres llamados Victims. Para defenderlo, crearon una especie de robots de gran poder y de gigantescas proporciones, a los que bautizaron Diosas, creando 5 de estos. Sin embargo, para poder controlarlos, se requiere un entrenamiento especial, y tener poderes sobrenaturales, los poderes EX. Es para ello que crean el G.O.A, una academia de adiestramiento.", "img": "/uploads/animes/covers/669.jpg", "genre": ["Acción", "Ciencia Ficción", "Espacial", "Mecha", "Militar"], "type": "Anime", "web_state": "Finalizado", "votes": 34, "name": "Megami Kouhosei", "id": "669", "slug": "megami-kouhosei", "episodes_num": 12, "animeRel": []}
{"index": {"_index": "anime_data"}}
{"rating": "3.9", "description": "Divertida historia en la que Luffy y el resto de los mugiwaras deberán recuperar el sombrero de Luffy de un \"pájaro\" que lo da todo por una gran amistad.", "img": "/uploads/animes/covers/671.jpg", "genre": ["Acción", "Aventuras", "Comedia", "Fantasía", "Shounen"], "type": "Película", "web_state": "Finalizado", "votes": 154, "name": "One Piece 3D: Mugiwara Chase", "id": "671", "slug": "one-piece-3d", "episodes_num": 1, "animeRel": [{"name": "One Piece", "type": " (Historia Principal)", "slug": "one-piece-tv"}]}
{"index": {"_index": "anime_data"}}
{"rating": "4.7", "description": "\"El corazón del tiempo infinito dejó de latir, y los humanos desaparecieron sin hacer ruido. Nadie se da cuenta de cómo el mundo se trastorna mientras es cubierto por las llamas del Mundo Carmesí.\" Sakai Yuji llevaba una vida normal de estudiante hasta que un día descubrió que ya había muerto... que era sólo una antorcha que poco a poco se iba apagando hasta desaparecer. Sin embargo, no sabía que además es objetivo de los devoradores de almas del Mundo Carmesí por la peculiaridad de tener un mistes como morador en su interior. Para evitar que los devoradores se hagan con el mistes, una Flame Haze se encargará de que esto no ocurra. No obstante, esto los llevará a tener batallas con los devoradores y conllevar una relación algo complicada, sobre todo para nuestra Flame Haze, quien no sabe cómo lidiar con la vida cotidiana de un alumno de secundaria. ", "img": "/uploads/animes/covers/672.jpg", "genre": ["Acción", "Drama", "Escolares", "Fantasía", "Romance", "Sobrenatural"], "type": "Anime", "web_state": "Finalizado", "votes": 218, "name": "Shakugan no Shana Second", "id": "672", "slug": "shakugan-no-shana-second", "episodes_num": 24, "animeRel": [{"name": "Shakugan no Shana", "type": " (Precuela)", "slug": "shakugan-no-shana"}, {"name": "Shakugan no Shana S", "type": " (Secuela)", "slug": "shakugan-no-shana-s"}]}
{"index": {"_index": "anime_data"}}
{"rating": "4.7", "description": "Si quieres agregar una Sinopsis de Ao no Exorcist: Kuro no Iede, adelante!", "img": "/uploads/animes/covers/673.jpg", "genre": ["Acción", "Demonios", "Fantasía", "Shounen", "Sobrenatural"], "type": "OVA", "web_state": "Finalizado", "votes": 171, "name": "Ao no Exorcist: Kuro no Iede", "id": "673", "slug": "ao-no-exorcist-kuro-no-iede", "episodes_num": 1, "animeRel": []}
{"index": {"_index": "anime_data"}}
{"rating": "4.5", "description": "La historia se lleva a cabo unos años después del final de la Gran Guerra antes de los acontecimientos en Tales of Vesperia. El emperador anterior acababa de morir y su posición permanece vacante sin heredero designado antes de su muerte, sin embargo, el mundo aparentemente permanece en un estado de paz. Utilizando el poder de una sustancia de gran alcance conocido como Aer la gente del planeta Terca Lumireis están en una edad de descubrimiento y de prosperidad. La forma cristalizada de aer que se conoce como apatheia, se considera una fuente de energía muy poderosa, ya que es esencial para la vida humana. Con el fin de proteger a los pueblos de los ataques de monstruos de grandes cantidades de apatheia se están produciendo para crear barreras en torno a las ciudades.\n", "img": "/uploads/animes/covers/674.jpg", "genre": ["Acción", "Aventuras", "Fantasía", "Magia", "Militar"], "type": "Película", "web_state": "Finalizado", "votes": 41, "name": "Tales of Vesperia The First Strike", "id": "674", "slug": "tales-of-vesperia", "episodes_num": 1, "animeRel": [{"name": "Tales of the Abyss", "type": " (Spin-Off)", "slug": "tales-of-the-abyss"}, {"name": "Tales of Phantasia", "type": " (Spin-Off)", "slug": "tales-of-phantasia"}]}
{"index": {"_index": "anime_data"}}
{"rating": "4.3", "description": "La pelicula es un remake de la primera temporada de la serie, que en resumen trata del encuentro de dos chicas por medio de la magia, una de ellas tratando de buscar objetos magicos ?Jewel Seeds? por encargo de su madre para realizar una investigacion prohibida y la otra tratando de evitar que la misma los recolecte. La historia se lleva a cabo entre este planeta y espacios interdimensionales, con personajes humanos normales y personajes con poderes magicos y poderes de transformacion. ", "img": "/uploads/animes/covers/675.jpg", "genre": ["Acción", "Comedia", "Drama", "Magia", "Superpoderes"], "type": "Película", "web_state": "Finalizado", "votes": 76, "name": "Mahou Shoujo Lyrical Nanoha the Movie 1st", "id": "675", "slug": "mahou-shoujo-lyrical-nanoha-the-movie", "episodes_num": 1, "animeRel": [{"name": "Mahou Shoujo Lyrical Nanoha the Movie 2nd", "type": " (Secuela)", "slug": "mahou-shoujo-lyrical-nanoha-the-movie-2nd"}, {"name": "Magical Girl Lyrical Nanoha", "type": " (Historia Completa)", "slug": "magical-girl-lyrical-nanoha"}]}
{"index": {"_index": "anime_data"}}
{"rating": "4.1", "description": "Basada en la novela homónima de Takafumi Takada. La historia cuenta las aventuras de un chico de 15 años que viaja hacia atrás en el tiempo hasta el periodo Heian en la antigua capital de Japón, Kyoto donde se libra la batalla entre dos bandos Oni (demonios) y humanos, allí el chico se verá envuelto en esta gran batalla.                                                  \n", "img": "/uploads/animes/covers/676.jpg", "genre": ["Acción", "Demonios", "Sobrenatural"], "type": "Película", "web_state": "Finalizado", "votes": 32, "name": "La Leyenda del Dragón Milenario", "id": "676", "slug": "la-leyenda-del-dragon-milenario", "episodes_num": 1, "animeRel": []}
{"index": {"_index": "anime_data"}}
{"rating": "4.1", "description": "Imagina que despiertas en un tubo de hibernación, tras haber pasado más de 20 años congelado en un profundo sueño, y ¿qué es lo que encuentras?. Pues un mundo totalmente distinto, donde el peligro acecha en cada esquina, donde el miedo se respira en el ambiente, un lugar más terrorífico aún que la peor de tus pesadillas... ¿Qué sentirías al saber que la raza humana se ha convertido en el aperitivo especial de unas horribles criaturas?. Es mejor no saberlo...\nPero no te engañes, estás en la Tierra, año 2031, un tiempo en el que el planeta ya no nos pertenece... un tiempo en el que el cazador, el hombre, es cazado por unos monstruosos engendros con forma de insectos, denominados BLUE. ", "img": "/uploads/animes/covers/677.jpg", "genre": ["Aventuras", "Ciencia Ficción", "Drama", "Espacial", "Mecha", "Militar", "Romance", "Terror"], "type": "Película", "web_state": "Finalizado", "votes": 12, "name": "Blue Gender The Warrior", "id": "677", "slug": "blue-gender-the-warrior", "episodes_num": 1, "animeRel": [{"name": "Blue Gender", "type": " (Historia Completa)", "slug": "blue-gender"}]}
{"index": {"_index": "anime_data"}}
{"rating": "4.7", "description": "En estas 3 Ovas, Rockman, sus amigos e incluso el Dr. Wily saldrán del juego para darse un paseíto por Japón mostrándonos varias de las costumbres de por allí, todo eso mientras Rockman y Wily se pelean como siempre hicieron desde la NES.\n¿Podrá Rockman evitar que el Dr. Wily convierta Japón en su nueva base robótica?\n", "img": "/uploads/animes/covers/680.jpg", "genre": ["Acción", "Aventuras", "Ciencia Ficción"], "type": "OVA", "web_state": "Finalizado", "votes": 26, "name": "Megaman Upon a Star", "id": "680", "slug": "megaman-upon-a-star", "episodes_num": 3, "animeRel": [{"name": "MegaMan Maverick Hunter X The Day of Sigma", "type": " (Precuela)", "slug": "megaman-maverick-hunter-x-the-day-of-sigma"}]}
{"index": {"_index": "anime_data"}}
{"rating": "4.6", "description": "Megaman no es un anime en sí, las ovas existentes están basadas en un videojuego llamado Rockman (en japón} Megamán (aqui en occidente). Es la historia de un robot llamado X el cual pelea contra los Maveriks que son robots que se han opuesto a los humanos y se dedican a destruir, X junto con Zero, otro riploid están dedicados a proteger la paz del mundo donde habitan.\n", "img": "/uploads/animes/covers/681.jpg", "genre": ["Acción", "Ciencia Ficción", "Mecha", "Shounen"], "type": "OVA", "web_state": "Finalizado", "votes": 44, "name": "MegaMan Maverick Hunter X The Day of Sigma", "id": "681", "slug": "megaman-maverick-hunter-x-the-day-of-sigma", "episodes_num": 1, "animeRel": [{"name": "Megaman Upon a Star", "type": " (Secuela)", "slug": "megaman-upon-a-star"}]}
{"index": {"_index": "anime_data"}}
{"rating": "4.5", "description": "La historia está protagonizada por Madoka, una chica de 17 años que aspira a ayudar a cualquiera que tenga problemas en su pueblo natal, Kamogawa, en Chiba. Ella es el único miembro del ?Club del Jersey? que creó para tal propósito, pero conseguirá meter en él a una preciosa chica un tanto extraña llamada Ran y a una estudiante recién transferida a su instituto llamada Muginami.", "img": "/uploads/animes/covers/709.jpg", "genre": ["Acción", "Ciencia Ficción", "Comedia", "Mecha"], "type": "Anime", "web_state": "Finalizado", "votes": 49, "name": "Rinne no Lagrange", "id": "709", "slug": "rinne-no-lagrange", "episodes_num": 12, "animeRel": []}
{"index": {"_index": "anime_data"}}
{"rating": "2.2", "description": "Ocho combatientes de viaje, unidos por un destino común, se reúnen ahora en la Arena Toshinden Battle: un torneo de lucha organizada por una organización misteriosa conocida como la Sociedad\" Secret \" Muchos años han pasado desde que este torneo, conocido sólo a aquellos en el mundo subterráneo, fue celebrada el pasado.Algunos combatientes han llegado a la gloria personal.Otros han llegado a luchar por aquellos que les gusta, pero todos harán todo lo posible para obtener la victoria en este torneo que decidirá su suerte.", "img": "/uploads/animes/covers/691.jpg", "genre": ["Acción", "Artes Marciales"], "type": "OVA", "web_state": "Finalizado", "votes": 28, "name": "Battle arena Toshiden", "id": "691", "slug": "battle-arena-toshiden", "episodes_num": 2, "animeRel": []}
{"index": {"_index": "anime_data"}}
{"rating": "4.4", "description": "OVA incluida en el DVD", "img": "/uploads/animes/covers/710.jpg", "genre": ["Comedia", "Ecchi", "Escolares", "Romance"], "type": "OVA", "web_state": "Finalizado", "votes": 61, "name": "Hoshizora e Kakaru Hashi OVA", "id": "710", "slug": "hoshizora-e-kakaru-hashi-ova", "episodes_num": 1, "animeRel": []}
{"index": {"_index": "anime_data"}}
{"rating": "4.4", "description": "La tercera temporada y volumen final del anime de Carnival Phantasm, incluirá un especial animado de 12 minutos llamado ?Fate/Prototype? El especial es una versión animada resumida de la novela que Kinoko Nasu escribió en el instituto como borrador original de Fate/stay night. ", "img": "/uploads/animes/covers/711.jpg", "genre": ["Acción", "Fantasía", "Magia", "Romance", "Shounen", "Sobrenatural"], "type": "OVA", "web_state": "Finalizado", "votes": 128, "name": "Fate Prototype", "id": "711", "slug": "fate-prototype", "episodes_num": 1, "animeRel": [{"name": "Fate/Zero 2", "type": " (Precuela)", "slug": "fate-zero-ii"}, {"name": "Kara no Kyoukai - the Garden of sinners", "type": " (Precuela)", "slug": "kara-no-kyoukai"}, {"name": "Tsukihime, Lunar Legend", "type": " (Precuela)", "slug": "tsukihime"}, {"name": "Fate/stay night Unlimited Blade Works", "type": " (Precuela)", "slug": "fate-stay-night-unilimted"}, {"name": "Carnival Phantasm", "type": " (Precuela)", "slug": "carnival-phantasm"}]}
{"index": {"_index": "anime_data"}}
{"rating": "4.7", "description": "Cuarta temporada de esta serie. La historia se centra en un adolescente huérfano llamado Natsume Takashi. Natsume en apariencia sólo es un chico normal, pero tiene la habilidad de ver espíritus, un poder heredado de su abuela, Reiko. Tras su muerte, Reiko deja en herencia a su nieto sólo una pertenencia - el Libro de los Amigos, un libro que contiene los nombres de los espíritus que Reiko había intimidado para firmar un contrato y convertirse en su seguidor. Ahora, Natsume se dedica a liberar a los espíritus y disolver los contratos. Con la ayuda de Nyanco-sensei , este se dispone a devolver los nombres a los espíritus.", "img": "/uploads/animes/covers/712.jpg", "genre": ["Drama", "Fantasía", "Recuentos de la vida", "Shoujo", "Sobrenatural"], "type": "Anime", "web_state": "Finalizado", "votes": 218, "name": "Natsume Yuujin-Chou Shi", "id": "712", "slug": "natsume-yuujin-chou-shi", "episodes_num": 13, "animeRel": [{"name": "Natsume Yujin-Cho San", "type": " (Precuela)", "slug": "natsume-yujin-cho-san"}, {"name": "Natsume Yuujinchou: Itsuka Yuki no Hi ni", "type": " (Historia Principal)", "slug": "natsume-yuujinchou-itsuka-yuki"}, {"name": "Natsume Yuujinchou LaLa Special", "type": " (Secuela)", "slug": "natsume-yuujinchou-lala-special"}, {"name": "Natsume Yuujinchou Go", "type": " (Secuela)", "slug": "natsume-yuujinchou-go"}]}
{"index": {"_index": "anime_data"}}
{"rating": "4.5", "description": "Continuación de la famosa serie Tennis no Oujisama o Prince of Tennis. Esta nueva historia transcurre luego de haber finalizado el Torneo el Nacional, donde Echizen Ryoma se había ido a Estados Unidos, pero es convocado desde Japón para formar una selección sub-17 para participar del torneo mundial de tennis.", "img": "/uploads/animes/covers/713.jpg", "genre": ["Acción", "Comedia", "Deportes", "Shounen"], "type": "Anime", "web_state": "Finalizado", "votes": 97, "name": "New Prince of Tennis", "id": "713", "slug": "new-prince-of-tennis", "episodes_num": 13, "animeRel": [{"name": "Tennis no Ouji-sama: Zenkoku Taikai Hen - Final", "type": " (Precuela)", "slug": "tennis-no-ouji-sama-zenkoku-taikai-hen-final"}, {"name": "New Prince of Tennis Ova", "type": " (Precuela)", "slug": "new-prince-of-tennis-ova"}]}
{"index": {"_index": "anime_data"}}
{"rating": "4.7", "description": "Gira en torno a Atsushi Miyagawa y su hermana Atsumi Miyagawa. Atsushi se parece a un adulto a 180 centímetros de altura, pero en realidad es un niño de escuela primaria. Atsumi se ve como una niña pequeña de 137 centímetros de altura, pero en realidad está en la escuela secundaria.", "img": "/uploads/animes/covers/714.jpg", "genre": ["Comedia", "Escolares", "Recuentos de la vida", "Seinen"], "type": "Anime", "web_state": "Finalizado", "votes": 91, "name": "Recorder to Randoseru Do", "id": "714", "slug": "recorder-to-randoseru", "episodes_num": 13, "animeRel": [{"name": "Recorder to Randoseru Re♪", "type": " (Secuela)", "slug": "recorder-to-randoseru-re"}]}
{"index": {"_index": "anime_data"}}
{"rating": "4.5", "description": "Mato Kuroi una alegre y activa chica llega a su primer día de instituto, y una joven le llama la atención, se trata de Yomi Takanashi una chica madura que va a su misma clase. Ambas entablan amistad, una amistad que se irá fortaleciendo a traves del tiempo. Tras su llegada a segundo año de instituto son separadas y empiezan a distanciarse. Mientras tanto en algun lugar dos chicas se enfrentan entre ellas, una llevando una enorme arma de fuego de alto calibre (Black Rock Shooter) y la otra llevando una guadaña negra (Dead Master), ambas guardan un parecido considerable con las jovenes Yomi y Mato.", "img": "/uploads/animes/covers/737.jpg", "genre": ["Acción", "Drama", "Escolares", "Recuentos de la vida"], "type": "Anime", "web_state": "Finalizado", "votes": 199, "name": "Black Rock Shooter (TV)", "id": "737", "slug": "black-rock-shooter-tv", "episodes_num": 8, "animeRel": [{"name": "Black Rock Shooter", "type": " (Secuela)", "slug": "black-rock-shooter"}]}
{"index": {"_index": "anime_data"}}
{"rating": "4.7", "description": "Basada en un manga de 4-komas protagonizado por Sonya, una chica asesina que se dedica a ir a clases en una escuela normal. Yasuna, una chica que no le tiene miedo a nada, es algo torpe, se mantiene junto a Sonya sin darse cuenta de lo peligrosa que es ella. Junto a ellas se encuentra también Agiri, una ninja de la misma organización que Sonya.", "img": "/uploads/animes/covers/715.jpg", "genre": ["Comedia", "Escolares", "Seinen"], "type": "Anime", "web_state": "Finalizado", "votes": 129, "name": "Kill Me Baby", "id": "715", "slug": "kill-me-baby", "episodes_num": 13, "animeRel": []}
{"index": {"_index": "anime_data"}}
{"rating": "3.8", "description": "Unos misteriosos peces con piermas aparecen al sur de Japón, en Okinawa, y eso conlleva un horrible cambio en toda la vida animal de la zona. Tadashi y su novia Kaori se ven atrapados en la isla y con un destino todavía peor que la misma muerte.", "img": "/uploads/animes/covers/739.jpg", "genre": ["Terror"], "type": "OVA", "web_state": "Finalizado", "votes": 92, "name": "Gyo", "id": "739", "slug": "gyo", "episodes_num": 1, "animeRel": []}
{"index": {"_index": "anime_data"}}
{"rating": "4.4", "description": "Melvin Penal, cumpliendo su condena en la cárcel de la ciudad central de robo, escapa de la cárcel, y viaja hacia el oeste. Ed y Al se dedican a perseguirlo a la ciudad de Milos, donde se encuentran a una misteriosa niña Julia Criton, miembro de una organización llamada \"Murciélago Negro\".", "img": "/uploads/animes/covers/738.jpg", "genre": ["Acción", "Aventuras", "Comedia", "Drama", "Fantasía", "Magia", "Militar", "Shounen"], "type": "Película", "web_state": "Finalizado", "votes": 198, "name": "Fullmetal Alchemist: Milos No Sei-Naru Hoshi", "id": "738", "slug": "fullmetal-alchemist-milos-no-sei-naru-hoshi", "episodes_num": 1, "animeRel": [{"name": "Fullmetal Alchemist: Brotherhood", "type": " (Historia Principal)", "slug": "fullmetal-alchemist-brotherhood"}]}
{"index": {"_index": "anime_data"}}
{"rating": "4.6", "description": "Después de la desaparición de Yuu (Eucliwood Hellscythe) Ayumu y compañía deciden ir en su búsqueda no importando los peligros con los que se irán topando.", "img": "/uploads/animes/covers/764.jpg", "genre": ["Acción", "Comedia", "Ecchi", "Harem", "Magia", "Sobrenatural"], "type": "Anime", "web_state": "Finalizado", "votes": 347, "name": "Kore wa Zombie Desu ka? of the Dead", "id": "764", "slug": "kore-wa-zombie-desu-ka-of-the-dead", "episodes_num": 10, "animeRel": [{"name": "Kore wa Zombie Desu ka? of the Dead OVA", "type": " (Secuela)", "slug": "kore-wa-zombie-desu-ka-of-the-dead-ova"}, {"name": "Kore wa Zombie Desu ka? OVA", "type": " (Precuela)", "slug": "kore-wa-zombie-desu-ka-ova"}]}
{"index": {"_index": "anime_data"}}
{"rating": "4.5", "description": "La Historia gira alrededor de Medaka Kurokami, Chica Perfecta, de perfecto físico, perfecto carácter, perfectas notas. Y Zenkichi Hitoyoshi, amigo de la infancia de Medaka. Al asumir Medaka el puesto de presidenta del consejo estudiantil, esta ábrela medida de la ?Caja de sugerencias? con el fin de ayudar a todos los estudiantes en cualquier cosa, aunque sea imposible. Con el tiempo, Medaka y su consejo estudiantil se verán inmersos en una conspiración de siglos atrás, Batallas contra estudiantes sobrehumanos y sus Anormalidades. Todo sea por mantener la paz de la Academia Hakoniwa.", "img": "/uploads/animes/covers/765.jpg", "genre": ["Acción", "Artes Marciales", "Comedia", "Ecchi", "Escolares", "Shounen", "Superpoderes"], "type": "Anime", "web_state": "Finalizado", "votes": 200, "name": "Medaka Box", "id": "765", "slug": "medaka-box", "episodes_num": 12, "animeRel": [{"name": "Medaka Box Abnormal", "type": " (Secuela)", "slug": "medaka-box-abnormal"}]}
{"index": {"_index": "anime_data"}}
{"rating": "4.4", "description": "Tari Tari relata las aventuras de 3 chicas y 2 chicos de bachillerato con diferentes aspiraciones, en la edad de dejar de ser niño, pero sin ser un adulto aún. Wakana Sakai alguna vez tomó lecciones de música, pero las dejó tras la muerte de su madre; Konatsu Miyamoto es una chica muy positiva que gusta de cantar y que pasa mucho tiempo en el Club Coral; Sawa Okita es miembro del Club de Arquería y sueña con convertirse en una gran jinete; Taichi Tanaka asiste al Club de Bádminton, al que suele llegar tarde, y vive con su hermana que también estudia; y Wiin fue transferido a la clase de Wakana tras haber vivido 12 años en Australia. Este grupo de amigos fue unido por su gusto a la música, estando juntos en su último verano en el bachillerato.", "img": "/uploads/animes/covers/815.jpg", "genre": ["Escolares", "Música", "Recuentos de la vida"], "type": "Anime", "web_state": "Finalizado", "votes": 263, "name": "Tari Tari", "id": "815", "slug": "tari-tari", "episodes_num": 13, "animeRel": []}
{"index": {"_index": "anime_data"}}
{"rating": "3.7", "description": "La historia se centra alrededor de Marimo Nogami, una chica de cuarto año de primaria, la cual generalmente es tranquila,sin embargo, cierto incidente, lleva a Marimo a convertirse en una persona con mucha fuerza.", "img": "/uploads/animes/covers/834.jpg", "genre": ["Acción", "Shoujo"], "type": "OVA", "web_state": "Finalizado", "votes": 12, "name": "Marimo no Hana", "id": "834", "slug": "marimo-no-hana", "episodes_num": 1, "animeRel": []}
{"index": {"_index": "anime_data"}}
{"rating": "4.4", "description": "Heart no Kuni no Alice es una especie de parodia de Alicia en el país de las maravillas. En esta historia Alicia no cae por un espejo, sino que es raptada por un hombre misterioso con orejas de conejo. Para poder regresar a su mundo, participara en un juego lleno de aventuras y peligros, conociendo al sombrerero, la reina de los corazones...", "img": "/uploads/animes/covers/835.jpg", "genre": ["Fantasía", "Harem", "Romance", "Shoujo"], "type": "Película", "web_state": "Finalizado", "votes": 102, "name": "Gekijo-ban Heart no Kuni no Alice - Wonderful Wonder World", "id": "835", "slug": "gekijo-ban-heart-no-kuni-no-alice", "episodes_num": 1, "animeRel": []}
{"index": {"_index": "anime_data"}}
{"rating": "4.2", "description": "La historia está protagonizada por Itsuki Noya, un chico que quiere unirse al club de astronomía de su instituto pero que, por un error en la similitud del nombre, acaba uniéndose a un club para fujoshis.", "img": "/uploads/animes/covers/837.jpg", "genre": ["Comedia", "Ecchi", "Escolares", "Parodia", "Shounen"], "type": "Anime", "web_state": "Finalizado", "votes": 39, "name": "Ebiten: Kouritsu Ebisugawa Koukou Tenmonbu", "id": "837", "slug": "ebiten", "episodes_num": 15, "animeRel": [{"name": "Especial Ebiten: Kōritsu Ebisugawa Kōkō Tenmonbu", "type": " (Secuela)", "slug": "especial-ebiten-kritsu-ebisugawa-kk-tenmon"}]}
{"index": {"_index": "anime_data"}}
{"rating": "4.4", "description": "Después de los sucesos de la 1º y 2º temporada del anime; Mio, Ritsu, Yui, Mugi y Azusa hacen un viaje a Inglaterra para celebrar la graduación de las primeras cuatro y su ingreso a la universidad. Durante su viaje hay nostalgia por ser la ultima vez que Azusa estará con el resto del grupo como HTT (Houkago Tea Time) y también estará lleno confusiones al no saber comunicarse bien en un país que no conocen.", "img": "/uploads/animes/covers/838.jpg", "genre": ["Comedia", "Música", "Recuentos de la vida"], "type": "Película", "web_state": "Finalizado", "votes": 479, "name": "K-ON!!", "id": "838", "slug": "k-on-pelicula", "episodes_num": 1, "animeRel": [{"name": "K-ON!", "type": " (Precuela)", "slug": "k-on"}]}
{"index": {"_index": "anime_data"}}
{"rating": "4.1", "description": "Es el año 2020, en la ciudad de Tokyo, una estudiante de bachillerato cuyo padre ha hecho una aplicación para detectar terremotos a raíz del terremoto de Tohoku. Gracias a la voluntad de su padre, Mako decide estudiar informática y ayudar así al mundo.", "img": "/uploads/animes/covers/839.jpg", "genre": ["Ciencia Ficción"], "type": "OVA", "web_state": "Finalizado", "votes": 9, "name": "Computer Kakumei: Saikyou x Saisoku no Zunou Tanjou", "id": "839", "slug": "computer-kakumei", "episodes_num": 1, "animeRel": []}
{"index": {"_index": "anime_data"}}
{"rating": "4.6", "description": "Corto Animado de 12 Minutos de duración incluido como extra en la Edicion Limitada del videojuego de PC.", "img": "/uploads/animes/covers/840.jpg", "genre": ["Acción", "Ciencia Ficción", "Drama", "Superpoderes"], "type": "OVA", "web_state": "Finalizado", "votes": 125, "name": "Guilty Crown: Lost Christmas", "id": "840", "slug": "guilty-crown-lost-christmas", "episodes_num": 1, "animeRel": [{"name": "Guilty Crown", "type": " (Secuela)", "slug": "guilty-crown"}]}
{"index": {"_index": "anime_data"}}
{"rating": "4.8", "description": "Película de Steins;Gate realizada por el mismo equipo que hizo la serie de anime. El guión se la película es totalmente nuevo y se situa argumentalmente después del anime, en una línea de universo alternativa.", "img": "/uploads/animes/covers/1182.jpg", "genre": ["Ciencia Ficción", "Suspenso"], "type": "Película", "web_state": "Finalizado", "votes": 462, "name": "Steins;Gate Fuka Ryoiki no Deja vu", "id": "1182", "slug": "steins-gate-fuka-ryoiki-no-deja-vu", "episodes_num": 1, "animeRel": [{"name": "Steins;Gate: Oukoubakko no Poriomania", "type": " (Precuela)", "slug": "steinsgate-oukoubakko-no-poriomania"}]}
{"index": {"_index": "anime_data"}}
{"rating": "4.5", "description": "Una chica llamada Mitsuki Kanzaki vive con su hermanastro Yuya una vez que su madre se vuelve a casar. Un día, Mitsuki es poseída por el espíritu de lo que dice ser una joven chica, Hiyori Kotobuki. Hiyori, en el cuerpo de Mitsuki, tendrá que enamorarse de Yuya para poder avanzar e ir a las puertas del cielo.", "img": "/uploads/animes/covers/1206.jpg", "genre": ["Comedia", "Ecchi", "Romance", "Shounen", "Sobrenatural"], "type": "Anime", "web_state": "Finalizado", "votes": 308, "name": "Saikin, Imouto no Yousu ga Chotto Okashiinda ga", "id": "1206", "slug": "saikin-imouto-no-yousu-ga-chotto-okashiinda-ga", "episodes_num": 13, "animeRel": []}
{"index": {"_index": "anime_data"}}


# Buscar los animes cuya categoria sea "Pelicula"
GET /anime_data/_search
{
  "query": {
    "match": {
      "type": "Película"
    }
  }
}
# Solo utilice el parametro de match para buscar una coincidencia por el campo TYPE y especifique cual era el valor que yo queria que trajera dicho campo

# Buscar el top 3 de animes de cualquier categoria, cuyo Rating sea entre 4.5 y 5, ademas tegna entre 5 y 12 Episodios y ordenamos de forma descendente por el campo votes
GET /anime_data/_search
{
  "size": 3, 
  "query": {
    "bool": {
      "must": [
         {
           "range": {
             "rating": {
               "gte": 4.5,
               "lte": 5
             }
           }
         },
         {
           "range": {
             "episodes_num": {
               "gte": 5,
               "lte": 12
             }
           }
         }
      ]
    }
  },
  "sort": [
    {
      "votes": {
        "order": "desc"
      }
    }
  ]
}
# Con el parametro size, puedo limitar el número de resultado que nos aparece. Y al estar ordenados de forma descendente, ya seria nuestro TOP3.
# Con bool y must, hago la logica de un AND, y utilizando range puedo hacer la busqueda dentro de un rango de valores.
# Por ultimo con el paremetro sort, ordeno segun el campo y ya sea ascendente o descendente